app/controllers/products_controller.rb

SELECT DISTINCT `products`.* FROM `products` ORDER BY `products`.`id` DESC
---
  def index
    #@products = Product.all.order(id: :desc)
    @q = Product.ransack(params[:q].try(:merge, m: params[:combinator]))
    @products = @q.result(distinct: true).order(id: :desc)

SELECT DISTINCT `products`.* FROM `products` ORDER BY `products`.`id` DESC LIMIT 16 OFFSET 0
---
  def inputs
    #@products = Product.all.order(id: :desc)
    @q = Product.ransack(params[:q].try(:merge, m: params[:combinator]))
    @products = @q.result(distinct: true).page(params[:page]).per(16).order(id: :desc)